{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Graph databases\n",
    "\n",
    "So far we've been using a relational database with SQL to construct our `eval`\n",
    "queries. Since we're storing a directed acyclic graph, it might make more sense\n",
    "to use a graph database. We'll take a look at [Neo4j](https://neo4j.com/) with\n",
    "the [Cypher](https://neo4j.com/docs/cypher-manual/current/introduction/) query\n",
    "language to see how they compare to our relational query."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Database setup\n",
    "\n",
    "To evaluate this notebook, we'll need a Neo4j instance. Use the following docker\n",
    "command to start one:\n",
    "\n",
    "```bash\n",
    "docker run \\\n",
    "  --rm \\\n",
    "  -p 7474:7474 -p 7687:7687 \\\n",
    "  -e NEO4J_dbms_security_auth__enabled=false \\\n",
    "  neo4j:5.22.0\n",
    "```\n",
    "\n",
    "The graphical interface is now available at\n",
    "[http://localhost:7474](http://localhost:7474). \n",
    "\n",
    "This command does not persist\n",
    "any state, which is what we want for our experimentation. Authentication is\n",
    "disabled for ease of use as well."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Creating the model\n",
    "\n",
    "As always, we first need a neural network to store and query. We'll reuse our\n",
    "model with multiple input and output nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "import torch\n",
    "import numpy as np\n",
    "import utils.sqlite as db\n",
    "import pandas as pd\n",
    "import utils.nn as nn\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "torch.manual_seed(223)\n",
    "\n",
    "def f(x, y):\n",
    "    return [2*x, 4*y]\n",
    "\n",
    "num_samples = 100\n",
    "x_train = torch.randn(num_samples, 2) * 100\n",
    "y_train = [f(x,y) for [x,y] in x_train]\n",
    "\n",
    "model = nn.ReLUFNN(input_size=2, output_size=2, hidden_size=2, num_hidden_layers=1)\n",
    "nn.train(model, x_train, y_train, save_path=\"models/eval_graph.pt\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Creating the database\n",
    "\n",
    "Now let's try to insert that into Neo4j. This is basically a slight adaptation\n",
    "from the [SQLite](./utils/sqlite.py) version."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"neo4j://localhost\")\n",
    "driver.verify_connectivity()\n",
    "\n",
    "# Delete any preexisting data.\n",
    "driver.execute_query(\"MATCH (n) DETACH DELETE n;\")\n",
    "\n",
    "state_dict = model.state_dict()\n",
    "input_weights = list(state_dict.items())[0][1].tolist()\n",
    "num_input_nodes = len(input_weights[0])\n",
    "\n",
    "node_ids = [[]]\n",
    "\n",
    "def create_node(tx, label, bias):\n",
    "    query = \"\"\"\n",
    "        CREATE (n:Node {bias: $bias, label: $label})\n",
    "        RETURN elementId(n) AS nodeId\n",
    "    \"\"\"\n",
    "\n",
    "    result = tx.run(query, bias=bias, label=label)\n",
    "    return result.single()\n",
    "\n",
    "def create_edge(tx, from_id, to_id, weight):\n",
    "    query = \"\"\"\n",
    "        MATCH (a) WHERE elementId(a) = $from_id\n",
    "        MATCH (b) WHERE elementId(b) = $to_id\n",
    "        CREATE (a)-[r:EDGE {weight: $weight}]->(b)\n",
    "    \"\"\"\n",
    "    result = tx.run(query, from_id=from_id, to_id=to_id, weight=weight)\n",
    "    return result.single()\n",
    "\n",
    "with driver.session() as session:\n",
    "    # Insert input nodes.\n",
    "    for i in range(0, num_input_nodes):\n",
    "        result = session.execute_write(create_node, f\"input.{i}\", 0)\n",
    "        node_ids[0].append(result['nodeId'])\n",
    "\n",
    "    layer = 0\n",
    "    # In the first pass, insert all nodes with their biases\n",
    "    for name, values in state_dict.items():\n",
    "        if not \"bias\" in name:\n",
    "            continue\n",
    "\n",
    "        node_ids.append([])\n",
    "        layer += 1\n",
    "        for i, bias in enumerate(values.tolist()):\n",
    "            result = session.execute_write(create_node, f\"{name}.{i}\", bias)\n",
    "            node_ids[layer].append(result['nodeId'])\n",
    "\n",
    "    # In the second pass, insert all edges and their weights. This assumes a fully\n",
    "    # connected network.\n",
    "    layer = 0\n",
    "    for name, values in state_dict.items():\n",
    "        if not \"weight\" in name:\n",
    "            continue\n",
    "\n",
    "        # Each weight tensor has a list for each node in the next layer. The\n",
    "        # elements of this list correspond to the nodes of the current layer.\n",
    "        weight_tensor = values.tolist()\n",
    "        for from_index, from_node in enumerate(node_ids[layer]):\n",
    "            for to_index, to_node in enumerate(node_ids[layer + 1]):\n",
    "                weight = weight_tensor[to_index][from_index]\n",
    "                session.execute_write(create_edge, from_node, to_node, weight)\n",
    "\n",
    "        layer += 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If you head over to [localhost:7474](http://localhost:7474), you can run the\n",
    "following query to fetch the network:\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Node) RETURN n\n",
    "```\n",
    "\n",
    "The result will look something like this:\n",
    "\n",
    "![Neo4j database as an image](./assets/neo4j_graph.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Writing the Cypher query\n",
    "\n",
    "To match the FO(SUM) language, our first SQL queries did not use any recursion.\n",
    "Instead, we assumed the number of hidden layers was known beforehand and we\n",
    "explicitly added each layer to the query. We'll do the same for Cypher. This is\n",
    "probably even necessary, since Cypher seems to lack recursion (without\n",
    "extensions).\n",
    "\n",
    "The full Cypher query to evaluate the neural network is given as follows:\n",
    "\n",
    "```cypher\n",
    "WITH [5, 20] AS inputValues\n",
    "\n",
    "MATCH (inputNode:Node)\n",
    "WHERE NOT (:Node)-[:EDGE]->(inputNode)\n",
    "\n",
    "WITH inputValues, collect(inputNode) AS inputNodes\n",
    "UNWIND range(0, size(inputValues) - 1) AS idx\n",
    "WITH inputValues[idx] AS inputValue, inputNodes[idx] AS inputNode\n",
    "\n",
    "MATCH (inputNode:Node)-[e:EDGE]->(t1:Node)\n",
    "WITH\n",
    "    t1,\n",
    "    CASE \n",
    "        WHEN SUM(e.weight * inputValue) + t1.bias > 0\n",
    "        THEN SUM(e.weight * inputValue) + t1.bias\n",
    "        ELSE 0\n",
    "    END AS value\n",
    "\n",
    "MATCH (t1:Node)-[e:EDGE]->(t2:Node)\n",
    "WITH\n",
    "    t2,\n",
    "    SUM(e.weight * value) + t2.bias AS value\n",
    "\n",
    "RETURN t2, value\n",
    "ORDER BY elementId(t2)\n",
    "```\n",
    "\n",
    "Let's break that down.\n",
    "\n",
    "```cypher\n",
    "WITH [5, 20] AS inputValues\n",
    "```\n",
    "\n",
    "This clause simply specifies the input values as a list.\n",
    "\n",
    "```cypher\n",
    "MATCH (inputNode:Node)\n",
    "WHERE NOT (:Node)-[:EDGE]->(inputNode)\n",
    "```\n",
    "\n",
    "Here we define the set of input nodes as the nodes that do not have an incoming\n",
    "edge. This shows how Cypher queries are visually expressive, especially compared\n",
    "to their SQL counterparts.\n",
    "\n",
    "```cypher\n",
    "WITH inputValues, collect(inputNode) AS inputNodes\n",
    "UNWIND range(0, size(inputValues) - 1) AS idx\n",
    "WITH inputValues[idx] AS inputValue, inputNodes[idx] AS inputNode\n",
    "```\n",
    "\n",
    "This part associates each input node with an index (cfr. SQL's `ROW_NUMBER`).\n",
    "With this index we can connect each input node to their respective input value\n",
    "that was defined as the first thing in the query.\n",
    "\n",
    "```cypher\n",
    "MATCH (inputNode:Node)-[e:EDGE]->(t1:Node)\n",
    "WITH\n",
    "    t1,\n",
    "    CASE \n",
    "        WHEN SUM(e.weight * inputValue) + t1.bias > 0\n",
    "        THEN SUM(e.weight * inputValue) + t1.bias\n",
    "        ELSE 0\n",
    "    END AS value\n",
    "```\n",
    "\n",
    "Now we can calculate the term $t_1$. The `CASE`-expression represents the ReLU\n",
    "function.\n",
    "\n",
    "If the neural network has more layers, we have to repeatedly add similar\n",
    "expressions to the query.\n",
    "\n",
    "```cypher\n",
    "MATCH (t1:Node)-[e:EDGE]->(t2:Node)\n",
    "WITH\n",
    "    t2,\n",
    "    SUM(e.weight * value) + t2.bias AS value\n",
    "```\n",
    "\n",
    "Finally, by using the same expression with the ReLU omitted, we calculate the\n",
    "output values."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Evalutation\n",
    "\n",
    "Let's implement this in Python and compare the results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eval_cypher(inputs):\n",
    "    query = f\"\"\"\n",
    "        WITH [{', '.join([str(input) for input in inputs])}] AS inputValues\n",
    "\n",
    "        MATCH (inputNode:Node)\n",
    "        WHERE NOT (:Node)-[:EDGE]->(inputNode)\n",
    "\n",
    "        WITH inputValues, collect(inputNode) AS inputNodes\n",
    "        UNWIND range(0, size(inputValues) - 1) AS idx\n",
    "        WITH inputValues[idx] AS inputValue, inputNodes[idx] AS inputNode\n",
    "\n",
    "        MATCH (inputNode:Node)-[e:EDGE]->(t1:Node)\n",
    "        WITH\n",
    "            t1,\n",
    "            CASE\n",
    "                WHEN SUM(e.weight * inputValue) + t1.bias > 0\n",
    "                THEN SUM(e.weight * inputValue) + t1.bias\n",
    "                ELSE 0\n",
    "            END AS value\n",
    "\n",
    "        // If there are more layers, we need to manually add them here.\n",
    "\n",
    "        MATCH (t1:Node)-[e:EDGE]->(t2:Node)\n",
    "        WITH\n",
    "            t2,\n",
    "            SUM(e.weight * value) + t2.bias AS value\n",
    "\n",
    "        RETURN t2, value\n",
    "        ORDER BY elementId(t2)\n",
    "    \"\"\"\n",
    "\n",
    "    results = driver.execute_query(query)[0]\n",
    "\n",
    "    return [result['value'] for result in results]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The neural network predicted [-24.508732  54.89358 ]\n",
      "The Cypher query calculated [-24.508734581785873, 54.89358546175163]\n"
     ]
    }
   ],
   "source": [
    "nn_output = model(torch.tensor([5,20], dtype=torch.float32)).detach().numpy()\n",
    "cypher_output = eval_cypher([5, 20])\n",
    "\n",
    "print(f\"The neural network predicted {nn_output}\")\n",
    "print(f\"The Cypher query calculated {cypher_output}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can see that the Cypher query returns the same value as the model.\n",
    "\n",
    "TODO: try out on larger model?\n",
    "\n",
    "## Conclusion\n",
    "\n",
    "As we've shown, it is possible to construct a similar `eval`-query in Cypher.\n",
    "Where SQL needs a lot of joins and aggregations, Cypher queries are a lot more\n",
    "elegant for graph structures."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
